zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_SIUL2.h
  __I  uint8_t GPDI179;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B0 */
  __I  uint8_t GPDI178;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B1 */
  __I  uint8_t GPDI177;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B2 */
  __I  uint8_t GPDI176;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B3 */
  __I  uint8_t GPDI183;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B4 */
  __I  uint8_t GPDI182;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B5 */
  __I  uint8_t GPDI181;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B6 */
  __I  uint8_t GPDI180;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B7 */
  __I  uint8_t GPDI187;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B8 */
  __I  uint8_t GPDI186;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15B9 */
  __I  uint8_t GPDI185;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15BA */
  __I  uint8_t GPDI184;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15BB */
  __I  uint8_t GPDI191;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15BC */
  __I  uint8_t GPDI190;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15BD */
  __I  uint8_t GPDI189;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15BE */
  __I  uint8_t GPDI188;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15BF */
  __I  uint8_t GPDI195;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C0 */
  __I  uint8_t GPDI194;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C1 */
  __I  uint8_t GPDI193;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C2 */
  __I  uint8_t GPDI192;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C3 */
  __I  uint8_t GPDI199;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C4 */
  __I  uint8_t GPDI198;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C5 */
  __I  uint8_t GPDI197;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C6 */
  __I  uint8_t GPDI196;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C7 */
  __I  uint8_t GPDI203;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C8 */
  __I  uint8_t GPDI202;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15C9 */
  __I  uint8_t GPDI201;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15CA */
  __I  uint8_t GPDI200;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15CB */
  __I  uint8_t GPDI207;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15CC */
  __I  uint8_t GPDI206;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15CD */
  __I  uint8_t GPDI205;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15CE */
  __I  uint8_t GPDI204;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15CF */
  __I  uint8_t GPDI211;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D0 */
  __I  uint8_t GPDI210;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D1 */
  __I  uint8_t GPDI209;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D2 */
  __I  uint8_t GPDI208;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D3 */
  __I  uint8_t GPDI215;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D4 */
  __I  uint8_t GPDI214;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D5 */
  __I  uint8_t GPDI213;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D6 */
  __I  uint8_t GPDI212;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D7 */
  __I  uint8_t GPDI219;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D8 */
  __I  uint8_t GPDI218;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15D9 */
  __I  uint8_t GPDI217;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15DA */
  __I  uint8_t GPDI216;                            /**< SIUL2 GPIO Pad Data Input Register, offset: 0x15DB */
  uint8_t RESERVED_15[292];
  __IO uint16_t PGPDO1;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1700 */
  __IO uint16_t PGPDO0;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1702 */
  __IO uint16_t PGPDO3;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1704 */
  __IO uint16_t PGPDO2;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1706 */
  __IO uint16_t PGPDO5;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1708 */
  __IO uint16_t PGPDO4;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x170A */
  __IO uint16_t PGPDO7;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x170C */
  __IO uint16_t PGPDO6;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x170E */
  __IO uint16_t PGPDO9;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1710 */
  __IO uint16_t PGPDO8;                            /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1712 */
  __IO uint16_t PGPDO11;                           /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1714 */
  __IO uint16_t PGPDO10;                           /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1716 */
  __IO uint16_t PGPDO13;                           /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x1718 */
  __IO uint16_t PGPDO12;                           /**< SIUL2 Parallel GPIO Pad Data Out Register, offset: 0x171A */
  uint8_t RESERVED_16[36];
  __I  uint16_t PGPDI1;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1740 */
  __I  uint16_t PGPDI0;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1742 */
  __I  uint16_t PGPDI3;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1744 */
  __I  uint16_t PGPDI2;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1746 */
  __I  uint16_t PGPDI5;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1748 */
  __I  uint16_t PGPDI4;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x174A */
  __I  uint16_t PGPDI7;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x174C */
  __I  uint16_t PGPDI6;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x174E */
  __I  uint16_t PGPDI9;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1750 */
  __I  uint16_t PGPDI8;                            /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1752 */
  __I  uint16_t PGPDI11;                           /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1754 */
  __I  uint16_t PGPDI10;                           /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1756 */
  __I  uint16_t PGPDI13;                           /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x1758 */
  __I  uint16_t PGPDI12;                           /**< SIUL2 Parallel GPIO Pad Data In Register, offset: 0x175A */
  uint8_t RESERVED_17[36];
  __O  uint32_t MPGPDO[SIUL2_MPGPDO_COUNT];        /**< SIUL2 Masked Parallel GPIO Pad Data Out Register, array offset: 0x1780, array step: 0x4 */
} SIUL2_Type, *SIUL2_MemMapPtr;

