zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_SIUL2.h
/*! @name GPDO209 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO209_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO209_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO209_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO209_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO209_PDO_n_SHIFT)) & SIUL2_GPDO209_PDO_n_MASK)
/*! @} */

/*! @name GPDO208 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO208_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO208_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO208_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO208_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO208_PDO_n_SHIFT)) & SIUL2_GPDO208_PDO_n_MASK)
/*! @} */

/*! @name GPDO215 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO215_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO215_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO215_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO215_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO215_PDO_n_SHIFT)) & SIUL2_GPDO215_PDO_n_MASK)
/*! @} */

/*! @name GPDO214 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO214_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO214_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO214_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO214_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO214_PDO_n_SHIFT)) & SIUL2_GPDO214_PDO_n_MASK)
/*! @} */

/*! @name GPDO213 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO213_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO213_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO213_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO213_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO213_PDO_n_SHIFT)) & SIUL2_GPDO213_PDO_n_MASK)
/*! @} */

/*! @name GPDO212 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO212_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO212_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO212_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO212_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO212_PDO_n_SHIFT)) & SIUL2_GPDO212_PDO_n_MASK)
/*! @} */

/*! @name GPDO219 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO219_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO219_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO219_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO219_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO219_PDO_n_SHIFT)) & SIUL2_GPDO219_PDO_n_MASK)
/*! @} */

/*! @name GPDO218 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO218_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO218_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO218_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO218_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO218_PDO_n_SHIFT)) & SIUL2_GPDO218_PDO_n_MASK)
/*! @} */

/*! @name GPDO217 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO217_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO217_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO217_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO217_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO217_PDO_n_SHIFT)) & SIUL2_GPDO217_PDO_n_MASK)
/*! @} */

/*! @name GPDO216 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO216_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO216_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO216_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO216_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO216_PDO_n_SHIFT)) & SIUL2_GPDO216_PDO_n_MASK)
/*! @} */

/*! @name GPDI3 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI3_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI3_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI3_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI3_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI3_PDI_n_SHIFT)) & SIUL2_GPDI3_PDI_n_MASK)
/*! @} */

/*! @name GPDI2 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI2_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI2_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI2_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI2_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI2_PDI_n_SHIFT)) & SIUL2_GPDI2_PDI_n_MASK)
/*! @} */

/*! @name GPDI1 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI1_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI1_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI1_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI1_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI1_PDI_n_SHIFT)) & SIUL2_GPDI1_PDI_n_MASK)
/*! @} */

/*! @name GPDI0 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI0_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI0_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI0_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI0_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI0_PDI_n_SHIFT)) & SIUL2_GPDI0_PDI_n_MASK)
/*! @} */

/*! @name GPDI7 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI7_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI7_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI7_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI7_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI7_PDI_n_SHIFT)) & SIUL2_GPDI7_PDI_n_MASK)
/*! @} */

/*! @name GPDI6 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI6_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI6_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI6_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI6_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI6_PDI_n_SHIFT)) & SIUL2_GPDI6_PDI_n_MASK)
/*! @} */

/*! @name GPDI5 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI5_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI5_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI5_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI5_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI5_PDI_n_SHIFT)) & SIUL2_GPDI5_PDI_n_MASK)
/*! @} */

/*! @name GPDI4 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

