zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_SIUL2.h
#define SIUL2_GPDI200_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI200_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI200_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI200_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI200_PDI_n_SHIFT)) & SIUL2_GPDI200_PDI_n_MASK)
/*! @} */

/*! @name GPDI207 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI207_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI207_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI207_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI207_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI207_PDI_n_SHIFT)) & SIUL2_GPDI207_PDI_n_MASK)
/*! @} */

/*! @name GPDI206 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI206_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI206_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI206_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI206_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI206_PDI_n_SHIFT)) & SIUL2_GPDI206_PDI_n_MASK)
/*! @} */

/*! @name GPDI205 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI205_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI205_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI205_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI205_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI205_PDI_n_SHIFT)) & SIUL2_GPDI205_PDI_n_MASK)
/*! @} */

/*! @name GPDI204 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI204_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI204_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI204_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI204_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI204_PDI_n_SHIFT)) & SIUL2_GPDI204_PDI_n_MASK)
/*! @} */

/*! @name GPDI211 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI211_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI211_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI211_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI211_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI211_PDI_n_SHIFT)) & SIUL2_GPDI211_PDI_n_MASK)
/*! @} */

/*! @name GPDI210 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI210_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI210_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI210_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI210_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI210_PDI_n_SHIFT)) & SIUL2_GPDI210_PDI_n_MASK)
/*! @} */

/*! @name GPDI209 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI209_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI209_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI209_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI209_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI209_PDI_n_SHIFT)) & SIUL2_GPDI209_PDI_n_MASK)
/*! @} */

/*! @name GPDI208 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI208_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI208_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI208_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI208_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI208_PDI_n_SHIFT)) & SIUL2_GPDI208_PDI_n_MASK)
/*! @} */

/*! @name GPDI215 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI215_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI215_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI215_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI215_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI215_PDI_n_SHIFT)) & SIUL2_GPDI215_PDI_n_MASK)
/*! @} */

/*! @name GPDI214 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI214_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI214_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI214_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI214_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI214_PDI_n_SHIFT)) & SIUL2_GPDI214_PDI_n_MASK)
/*! @} */

/*! @name GPDI213 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI213_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI213_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI213_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI213_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI213_PDI_n_SHIFT)) & SIUL2_GPDI213_PDI_n_MASK)
/*! @} */

/*! @name GPDI212 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI212_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI212_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI212_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI212_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI212_PDI_n_SHIFT)) & SIUL2_GPDI212_PDI_n_MASK)
/*! @} */

/*! @name GPDI219 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI219_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI219_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI219_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI219_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI219_PDI_n_SHIFT)) & SIUL2_GPDI219_PDI_n_MASK)
/*! @} */

/*! @name GPDI218 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI218_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI218_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI218_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI218_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI218_PDI_n_SHIFT)) & SIUL2_GPDI218_PDI_n_MASK)
/*! @} */

/*! @name GPDI217 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI217_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI217_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI217_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI217_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI217_PDI_n_SHIFT)) & SIUL2_GPDI217_PDI_n_MASK)
/*! @} */

/*! @name GPDI216 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI216_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI216_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI216_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI216_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI216_PDI_n_SHIFT)) & SIUL2_GPDI216_PDI_n_MASK)
/*! @} */

/*! @name PGPDO1 - SIUL2 Parallel GPIO Pad Data Out Register */
/*! @{ */

